src/k-bench-results/k0s/reliability-worker/reliability-worker-3/memtier.out
4         Threads
50        Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         1707.66          ---          ---        10.64149         9.66300        21.24700        38.91100       131.55 
Gets        17074.95         7.33     17067.61        10.63842         9.66300        21.24700        38.91100       665.36 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      18782.61         7.33     17067.61        10.63870         9.66300        21.24700        38.91100       796.91 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.799        0.000
SET       8.703        5.000
SET       9.087       10.000
SET       9.279       15.000
SET       9.343       20.000
SET       9.407       25.000
SET       9.471       30.000
SET       9.535       35.000
SET       9.599       40.000
SET       9.663       45.000
SET       9.663       50.000
SET       9.727       52.500
SET       9.727       55.000
SET       9.791       57.500
SET       9.791       60.000
SET       9.855       62.500
SET       9.855       65.000
SET       9.919       67.500
SET       9.983       70.000
SET      10.047       72.500
SET      10.111       75.000
SET      10.111       76.250
SET      10.175       77.500
SET      10.239       78.750
SET      10.367       80.000
SET      10.495       81.250
SET      10.687       82.500
SET      10.943       83.750
SET      11.391       85.000
SET      11.839       86.250
SET      12.223       87.500
SET      12.479       88.125
SET      12.735       88.750
SET      13.183       89.375
SET      14.015       90.000
SET      15.487       90.625
SET      16.767       91.250
SET      17.535       91.875
SET      17.919       92.500
SET      18.175       93.125
SET      18.431       93.750
SET      18.559       94.062
SET      18.687       94.375
SET      18.815       94.688
SET      18.943       95.000
SET      18.943       95.312
SET      19.071       95.625
SET      19.199       95.938
SET      19.199       96.250
SET      19.327       96.562
SET      19.455       96.875
SET      19.455       97.031
SET      19.583       97.188
SET      19.583       97.344
SET      19.583       97.500
SET      19.711       97.656
SET      19.711       97.812
SET      19.839       97.969
SET      19.967       98.125
SET      19.967       98.281
SET      20.095       98.438
SET      20.223       98.516
SET      20.351       98.594
SET      20.351       98.672
SET      20.479       98.750
SET      20.607       98.828
SET      20.863       98.906
SET      21.119       98.984
SET      21.631       99.062
SET      22.143       99.141
SET      22.783       99.219
SET      23.039       99.258
SET      23.423       99.297
SET      23.807       99.336
SET      24.191       99.375
SET      24.703       99.414
SET      25.087       99.453
SET      25.727       99.492
SET      26.495       99.531
SET      27.263       99.570
SET      28.159       99.609
SET      28.671       99.629
SET      29.311       99.648
SET      29.823       99.668
SET      30.335       99.688
SET      30.975       99.707
SET      31.615       99.727
SET      32.383       99.746
SET      33.279       99.766
SET      34.047       99.785
SET      34.559       99.805
SET      35.071       99.814
SET      35.327       99.824
SET      35.839       99.834
SET      36.351       99.844
SET      36.607       99.854
SET      37.119       99.863
SET      37.631       99.873
SET      38.143       99.883
SET      38.655       99.893
SET      39.167       99.902
SET      39.679       99.907
SET      39.935       99.912
SET      40.191       99.917
SET      40.703       99.922
SET      40.959       99.927
SET      41.215       99.932
SET      41.727       99.937
SET      42.239       99.941
SET      42.751       99.946
SET      43.263       99.951
SET      43.519       99.954
SET      43.775       99.956
SET      44.287       99.958
SET      44.543       99.961
SET      44.799       99.963
SET      45.311       99.966
SET      45.823       99.968
SET      46.335       99.971
SET      46.591       99.973
SET      47.103       99.976
SET      47.359       99.977
SET      47.871       99.978
SET      47.871       99.979
SET      48.383       99.980
SET      48.639       99.982
SET      48.895       99.983
SET      49.407       99.984
SET      49.663       99.985
SET      50.175       99.987
SET      50.687       99.988
SET      50.943       99.988
SET      50.943       99.989
SET      51.199       99.990
SET      51.455       99.990
SET      51.967       99.991
SET      52.223       99.991
SET      52.223       99.992
SET      52.479       99.993
SET      52.479       99.993
SET      52.991       99.994
SET      52.991       99.994
SET      53.503       99.995
SET      53.759       99.995
SET      54.015       99.995
SET      54.015       99.995
SET      54.527       99.996
SET      54.783       99.996
SET      55.039       99.996
SET      55.551       99.997
SET      55.807       99.997
SET      56.063       99.997
SET      56.575       99.997
SET      56.575       99.997
SET      56.575       99.998
SET      57.087       99.998
SET      57.343       99.998
SET      57.855       99.998
SET      58.879       99.998
SET      58.879       99.998
SET      59.135       99.998
SET      59.391       99.999
SET      59.391       99.999
SET      59.391       99.999
SET      59.647       99.999
SET      59.647       99.999
SET      59.647       99.999
[...]
SET      59.903       99.999
SET      60.415       99.999
SET      61.439       99.999
SET      61.439       99.999
SET      61.439       99.999
SET      62.207       99.999
SET      62.207       99.999
SET      62.207       99.999
[...]
SET      62.207      100.000
SET      62.207      100.000
SET      62.207      100.000
SET      64.255      100.000
SET      64.255      100.000
SET      64.255      100.000
[...]
SET      68.607      100.000
SET      68.607      100.000
SET      68.607      100.000
[...]
SET      69.631      100.000
SET      69.631      100.000
---
GET       1.471        0.000
GET       8.703        5.000
GET       9.087       10.000
GET       9.279       15.000
GET       9.343       20.000
GET       9.407       25.000
GET       9.471       30.000
GET       9.535       35.000
GET       9.599       40.000
GET       9.663       45.000
GET       9.663       50.000
GET       9.727       52.500
GET       9.727       55.000
GET       9.791       57.500
GET       9.791       60.000
GET       9.855       62.500
GET       9.855       65.000
GET       9.919       67.500
GET       9.983       70.000
GET      10.047       72.500
GET      10.111       75.000
GET      10.111       76.250
GET      10.175       77.500
GET      10.239       78.750
GET      10.367       80.000
GET      10.495       81.250
GET      10.687       82.500
GET      10.943       83.750
GET      11.327       85.000
GET      11.775       86.250
GET      12.223       87.500
GET      12.479       88.125
GET      12.735       88.750
GET      13.183       89.375
GET      14.015       90.000
GET      15.487       90.625
GET      16.767       91.250
GET      17.535       91.875
GET      17.919       92.500
GET      18.303       93.125
GET      18.559       93.750
GET      18.559       94.062
GET      18.687       94.375
GET      18.815       94.688
GET      18.943       95.000
GET      18.943       95.312
GET      19.071       95.625
GET      19.199       95.938
GET      19.199       96.250
GET      19.327       96.562
GET      19.455       96.875
GET      19.455       97.031
GET      19.583       97.188
GET      19.583       97.344
GET      19.583       97.500
GET      19.711       97.656
GET      19.711       97.812
GET      19.839       97.969
GET      19.967       98.125
GET      19.967       98.281
GET      20.095       98.438
GET      20.223       98.516
GET      20.223       98.594
GET      20.351       98.672
GET      20.479       98.750
GET      20.607       98.828
GET      20.863       98.906
GET      21.119       98.984
GET      21.503       99.062
GET      22.015       99.141
GET      22.655       99.219
GET      23.039       99.258
GET      23.295       99.297
GET      23.807       99.336
GET      24.191       99.375
GET      24.575       99.414
GET      25.087       99.453
GET      25.599       99.492
GET      26.239       99.531
GET      27.135       99.570
GET      28.031       99.609
GET      28.543       99.629
GET      29.055       99.648
GET      29.567       99.668
GET      30.207       99.688
GET      30.719       99.707
GET      31.359       99.727
GET      32.127       99.746
GET      32.767       99.766
GET      33.535       99.785
GET      34.303       99.805
GET      34.815       99.814
GET      35.071       99.824
GET      35.583       99.834
GET      36.095       99.844
GET      36.351       99.854
GET      36.863       99.863
GET      37.375       99.873
GET      37.887       99.883
GET      38.399       99.893
GET      39.167       99.902
GET      39.423       99.907
GET      39.679       99.912
GET      39.935       99.917
GET      40.447       99.922
GET      40.703       99.927
GET      41.215       99.932
GET      41.471       99.937
GET      41.983       99.941
GET      42.495       99.946
GET      43.007       99.951
GET      43.263       99.954
GET      43.519       99.956
GET      43.775       99.958
GET      44.031       99.961
GET      44.543       99.963
GET      44.799       99.966
GET      45.311       99.968
GET      45.823       99.971
GET      46.335       99.973
GET      46.847       99.976
GET      47.103       99.977
GET      47.359       99.978
GET      47.615       99.979
GET      47.871       99.980
GET      48.383       99.982
GET      48.639       99.983
GET      48.895       99.984
GET      49.407       99.985
GET      49.663       99.987
GET      50.175       99.988
GET      50.431       99.988
GET      50.687       99.989
GET      50.943       99.990
GET      51.199       99.990
GET      51.455       99.991
GET      51.711       99.991
GET      51.967       99.992
GET      52.479       99.993
GET      52.735       99.993
GET      53.247       99.994
GET      53.503       99.994
GET      53.503       99.995
GET      54.015       99.995
GET      54.271       99.995
GET      54.527       99.995
GET      54.783       99.996
GET      55.295       99.996
GET      55.551       99.996
GET      55.807       99.997
GET      56.319       99.997
GET      56.319       99.997
GET      56.575       99.997
GET      56.831       99.997
GET      56.831       99.998
GET      57.343       99.998
GET      57.343       99.998
GET      57.599       99.998
GET      58.111       99.998
GET      58.623       99.998
GET      59.135       99.998
GET      59.391       99.999
GET      59.391       99.999
GET      59.647       99.999
GET      59.903       99.999
GET      60.159       99.999
GET      60.671       99.999
GET      60.927       99.999
GET      61.183       99.999
GET      61.439       99.999
GET      61.695       99.999
GET      61.951       99.999
GET      62.207       99.999
GET      62.463       99.999
GET      62.719       99.999
GET      63.231       99.999
GET      63.487       99.999
GET      63.999      100.000
GET      64.511      100.000
GET      65.023      100.000
GET      65.279      100.000
GET      65.279      100.000
GET      65.535      100.000
GET      66.047      100.000
GET      66.047      100.000
GET      66.559      100.000
GET      67.071      100.000
GET      67.583      100.000
GET      68.095      100.000
GET      68.607      100.000
GET      68.607      100.000
GET      69.119      100.000
GET      69.119      100.000
GET      69.119      100.000
[...]
GET      69.631      100.000
GET      69.631      100.000
GET      69.631      100.000
GET      70.143      100.000
GET      70.143      100.000
GET      70.143      100.000
[...]
GET      70.655      100.000
GET      70.655      100.000
GET      70.655      100.000
[...]
GET      71.167      100.000
GET      71.167      100.000
GET      71.167      100.000
[...]
GET      71.679      100.000
GET      71.679      100.000
---
WAIT      0.000      100.000